Revit 2017 API
ProjectPosition Properties
The ProjectPosition type exposes the following members.
Properties
Name | Description
Angle
Angle from True North
EastWest
East/West offset
Elevation
Elevation above ground level.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
NorthSouth
North/South offset
See Also
ProjectPosition Class
Autodesk.Revit.DB Namespace